# Python基础知识

# 1.单行注释: #+空格+注释
# Python Hello World示例程序！
print('Hello Python!演示单行注释!(格式: #+空格+注释内容)')

# 2.1.多行注释第一种: 多个单行注释组成一个多行注释
# 格式: 三个开始位置三个单引号, 结束位置三个单引号, 中间为注释内容
print('Hello Python!演示多行注释第一种!(格式: 多个单行注释组成一个多行注释)')

'''
    2.2.多行注释第二种: 一对英文状态下三个单引号
    格式: 开始位置三个单引号,结束位置三个单引号,中间为注释内容
'''
print('Hello Python!演示多行注释第二种!(格式: 一对三个单引号)')

"""
    2.3.多行注释第三种: 一对英文状态下三个双引号(脚本语言一般使用单引号多一些)
    格式: 开始位置三个双引号,结束位置三个双引号,中间为注释内容
"""
print('Hello Python!演示多行注释第三种!(格式: 一对三个多引号)')

'''
    3.Python2和Python3区别
        Python2默认不支持中文,Python3默认支持中文
'''