"""
    Python中的组包和拆包
"""

"""
    组包: 将多个值同时赋给一个容器类型变量时，解释器会自动进行组包操作
    拆包: 将一个容器值(元组)，里面的多个数据同时赋值多个变量，解释器会自动进行拆包操作
    注意: 拆包要注意被赋值的变量个数和元组中的值的个数相同，一般可以和函数返回值配合使用，让函数可以返回多个值
"""

# 元组组包
a = 1, 2, 3, 4, 5
print(a)
print(type(a))

# 元组拆包 注意:拆包时容器中的元素个数要和变量个数相同
a1, a2, a3, a4, a5 = a
print(a1, a2, a3, a4, a5)

# 列表组包
b = [1, 2, 3, 4, 5]
print(b)
print(type(b))

# 列表拆包 注意:拆包时容器中的元素个数要和变量个数相同
b1, b2, b3, b4, b5 = b
print(b1, b2, b3, b4, b5)

# 字典组包
c = {'c1': 1, 'c2': 2, 'c3': 3, 'c4': 4, 'c5': 5}
print(c)
print(type(c))

# 字典拆包 注意:拆包时容器中的元素个数要和变量个数相同
c1, c2, c3, c4, c5 = c
print(c1, c2, c3, c4, c5)
