# Python中的函数默认值参数、位置(关键字)参数和可变参数

print('Python中的函数默认值参数、位置(关键字)参数和可变参数')


'''
    默认参数值
    不传递参数b的情况下,函数使用默认参数值进行计算
'''
def add(a = 1,b = 4):
    print(f'a:%d' % a)
    print(f'b:%d' % b)
    return a + b

# 使用默认参数值
print(add(100))
# 不使用默认参数值
print(add(3,7))
print('----------------------------------')

'''
    位置参数可在传递参数时指定将什么值传递给哪个参数
'''
def sub(a, b):
    print(f'a = %d' % a)
    print(f'b = %d' % b)

# 普通调用
sub(1, 1000)
# 使用位置参数调用,可以在形参和实参位置不相同的情况下进行调用
sub(b=1000, a=1)
print('----------------------------------')


'''
    可变参数: 实际上就是一个组包的过程
'''
def multi(*vargs):
    print(vargs)

multi(1)
multi(1, 2)
multi(1, 2, 3)
multi(1, 2, 3, 4)

