"""
    python基础知识
"""

# 1.单行注释: #+空格+注释
# python hello world示例程序！
print('hello python!演示单行注释!(格式: #+空格+注释内容)')

# 2.1.多行注释第一种: 多个单行注释组成一个多行注释
# 格式: 三个开始位置三个单引号，结束位置三个单引号，中间为注释内容
print('hello python!演示多行注释第一种!(格式: 多个单行注释组成一个多行注释)')

'''
    2.2.多行注释第二种: 一对英文状态下三个单引号
    格式: 开始位置三个单引号，结束位置三个单引号，中间为注释内容
'''
print('hello python!演示多行注释第二种!(格式: 一对三个单引号)')

"""
    2.3.多行注释第三种: 一对英文状态下三个双引号(脚本语言一般使用单引号多一些)
    格式: 开始位置三个双引号，结束位置三个双引号，中间为注释内容
"""
print('hello python!演示多行注释第三种!(格式: 一对三个多引号)')

"""
    3.python2和python3区别
        python2默认不支持中文，python3默认支持中文
"""